app/controllers/api/likes_controller.rb

    def index
        @likes = Like.all
        @songs = [];
        @likes.each do |like|
            song = Song.find_by(id: like.song_id)
---
SELECT "likes".* FROM "likes"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]