app/models/user.rb

    def self.find_by_credentials(user_info, password)
        user = User.find_by(username: user_info)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo User"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "4EKJrd6E9qmDwleEPhu3AA"], ["updated_at", "2021-07-18 16:39:12.566255"], ["id", 1]]